/*!
 * @brief	シンプルシェーダー。
 */

//定数バッファ。
cbuffer c0 : register(b0){
	float4	color;		//カラー。
} ;


//--------------------------------------------------------------------------------------
// 頂点シェーダーのエントリー関数。
//--------------------------------------------------------------------------------------
float4 VS( float4 Pos : POSITION ) : SV_POSITION
{
	float4 pos = Pos;
    return pos;
}


//--------------------------------------------------------------------------------------
// ピクセルシェーダーのエントリ関数。
//--------------------------------------------------------------------------------------
float4 PS( float4 pos : SV_POSITION ) : SV_Target
{
    return color; 
}
